{
    "group": "device_detection",
    "categories": {
        "database_audit_system": {
            "label": "Database Audit System",
            "description": "Monitors and records all database activities, including queries, modifications, and access attempts, to ensure compliance and detect potential security breaches."
        },
        "firewall": {
            "label": "Firewall",
            "description": "A firewall is a network security device that monitors and controls incoming and outgoing network traffic based on predetermined security rules."
        },
        "web_application_firewall": {
            "label": "Web Application Firewall",
            "description": "A web application firewall (WAF) monitors and filters HTTP/HTTPS traffic to protect web applications from common attacks such as SQL injection, XSS, and CSRF."
        },
        "intrusion_prevention_detection_system": {
            "label": "Intrusion Prevention Detection System",
            "description": "Monitors network traffic for malicious activities or policy violations using signature-based or anomaly-based detection methods."
        },
        "antivirus": {
            "label": "Antivirus",
            "description": "Antivirus logs capture malware detection and prevention activities, including signature-based scanning and heuristic analysis for malicious files or processes."
        },
        "bastion_host": {
            "label": "Bastion Host",
            "description": "A bastion host is a specialized device that serves as a secure gateway for controlling and monitoring access to critical network resources, typically used for privileged access management."
        },
        "anti_spam_gateway": {
            "label": "Anti Spam Gateway",
            "description": "Monitors and filters unsolicited emails to prevent spam and phishing attacks from reaching the network."
        },
        "anti_ddos_system": {
            "label": "Anti DDoS System",
            "description": "Monitors and mitigates Distributed Denial of Service (DDoS) attacks by analyzing network traffic patterns and blocking malicious requests in real-time."
        },
        "nta_traffic": {
            "label": "Network Traffic Analysis",
            "description": "Network Traffic Analysis (NTA) focuses on monitoring and analyzing network traffic patterns to detect anomalies, intrusions, and potential security threats."
        },
        "edr_system": {
            "label": "Endpoint Detection And Response System",
            "description": "Endpoint Detection and Response (EDR) system logs capture detailed telemetry data from endpoints, including process execution, file modifications, and network connections, to detect and respond to potential threats."
        },
        "honeypot_system": {
            "label": "Honeypot System",
            "description": "A honeypot system designed to detect and analyze unauthorized access attempts by mimicking vulnerable devices or services."
        },
        "vpn_system": {
            "label": "VPN System",
            "description": "Monitors and analyzes VPN system activities, including connection attempts, authentication logs, and traffic patterns for security assessment."
        },
        "network_dlp_system": {
            "label": "Network DLP System",
            "description": "The network_dlp_system monitors and controls sensitive data transfers across the network to prevent unauthorized exfiltration or leakage."
        },
        "endpoint_dlp_system": {
            "label": "Endpoint DLP System",
            "description": "Endpoint DLP system logs capture data leakage prevention activities and policy violations on endpoint devices, including file transfers, unauthorized access attempts, and sensitive data handling."
        },
        "api_risk_monitoring_system": {
            "label": "API Risk Monitoring System",
            "description": "The API risk monitoring system detects and analyzes potential security threats and vulnerabilities in API communications and transactions."
        },
        "vulnerability_scanner": {
            "label": "Vulnerability Scanner",
            "description": "A vulnerability scanner is a security tool designed to detect and assess vulnerabilities in network devices, systems, and applications."
        },
        "zero_trust": {
            "label": "Zero Trust",
            "description": "Zero Trust security model continuously verifies device identity and compliance before granting access to network resources."
        }
    }
}